# -*- coding: utf-8 -*-

botToken = "575841584:AAFtrQNHO9JHUZJGobWh6-tI0sCxSSY20m4"
developerMode = True

# Database Credentials
databaseHost = "192.168.90.100"
databasePort = 32768
databaseName = "SNResistance"
databaseUsername = "postgres"
databasePassword = ""

# Redis Credentials
redisHost = "192.168.90.100"
redisPort = 32769
redisPassword = ""

startMessage = \
    "Благодарю за возникший интерес ко мне! *Cоциальные сети* — _абсолютное зло_ из 2004 года, с тех пор они _не видоизменились_ и _не поменяли_ своей сути." \
    "\n\n"\
    "На моей памяти существует множество людей, которые _хотели отказаться_ от социальных сетей, но не могли из-за одной их возможности — _сообществ_. " \
    "В Telegram для их замены существуют _каналы_, но их мало, кто создает и ведет их. Мне в один момент это надоело, поэтому сейчас и существует этот Бот, " \
    "который в этом хорошем деле поможет[.](http://telegra.ph/Otkaz-ot-polzovaniya-socialnymi-setyami-06-05) " \
    "[Также подпишитесь на канал](http://t.me/paparazziBarbos), в нем публикуются предложенные Вами посты, мои мысли, " \
    "репосты из других источников, картинки и вообще все, что реально годно!" \
    "\n\n" \
    "Бот работает в данный момент только с сообществами ВКонтакте. *Ниже перечислены основные его возможности, которые помогут отказаться от социальных сетей:*" \
    "\n" \
    "   - Вы можете задать Боту сообщества, из которых хотите получать репосты новых публикаций." \
    "\n" \
    "   - _Два раза в день_ Вы получаете подборку самых лучших публикаций из сообществ, на которые подписаны." \
    "\n\n" \
    "Более подробная информация обо всем расположена в полной статье, которая находится [здесь](http://telegra.ph/Otkaz-ot-polzovaniya-socialnymi-setyami-06-05)."

channelDescription = "Неофициальный Канал, созданный одним из пользователей @SNResistanceBot" \
                     "\n\nОн был создан исключительно для репостинга публикаций из одноименного " \
                     "сообщества ВКонтакте, чтобы полностью отказаться от социальных сетей." \
                     "\n\nПодробнее: @SNResistanceBot"
