# -*- coding: utf-8 -*-

botToken = "575841584:AAF4oo2IQdyGHVo1Ead1Ksrue-Pyfp8xv88"
developerMode = True

# Database Credentials
databaseHost = "172.17.0.3"
databasePort = 5432
databaseName = "SNResistance"
databaseUsername = "postgres"
databasePassword = "postgresPassword"

# Redis Credentials
redisHost = "172.17.0.4"
redisPort = 6379
redisPassword = ""

startMessage = \
    "*Cоциальные сети* — абсолютное зло из 2004 года, с тех пор они не видоизменились и не поменяли своей сути." \
    "\n\n"\
    "На моей памяти существует множество людей, которые хотели отказаться от социальных сетей, но не могли из-за одной их прекрасной возможности — сообществ. " \
    "В Telegram для их замены существуют каналы, но далеко не у каждого сообщества он есть (а если и есть, то в большинстве случаев посты появляются позже). Я столкнулся с такой же ситуацией в прошлом, поэтому сейчас и существует этот Бот, " \
    "который в этом хорошем деле поможет[.](http://telegra.ph/Otkaz-ot-polzovaniya-socialnymi-setyami-06-05) " \
    "[Советую также подписаться на мой канал](https://t.me/paparazziBarbos), в нем публикуются предложенные Вами посты, мои мысли, " \
    "репосты из других источников, картинки и вообще все, что реально годно." \
    "\n\n" \
    "Бот работает в данный момент только с сообществами ВКонтакте. Ниже перечислены основные его возможности, которые помогут отказаться от социальных сетей:" \
    "\n" \
    "   - Вы можете задать Боту сообщества, из которых хотите получать репосты новых публикаций." \
    "\n" \
    "   - Два раза в день Вы получаете подборку самых лучших публикаций из сообществ, на которые подписаны." \
    "\n\n" \
    "Более подробно обо мне можете прочитать [здесь](http://telegra.ph/Otkaz-ot-polzovaniya-socialnymi-setyami-06-05)."

channelDescription = "Неофициальный Канал сообщества, созданный одним из пользователей @SNResistanceBot"
