# -*- coding: utf-8 -*-

botToken = "575841584:AAFtrQNHO9JHUZJGobWh6-tI0sCxSSY20m4"
# paparazziBarbosBot -- 601202629:AAGre0DlwhcM-NHqB1Aht6T6V6OJuuZR7kk
# paparazziBRBot -- 617217526:AAHGu7g0z2flW4a6ulGpIdnJOvkZ3rhKAlA

botChannelID = "-1001217496073"
# Основной -- -1001338744519
# Тестирование -- -1001217496073

# Database Credentials
databaseHost = "192.168.90.100"
databasePort = 32768
databaseName = "SNResistance"
databaseUsername = "postgres"
databasePassword = ""

vkAccessTokens = [
    "bd2ef5deebe23c893fa585a43f2bf3b39956bed79efb50654857c4efb3daa264c26069acffc29ad597395",
    "5046fce036ed763f6e25834eae07ba559fadbfa77403d4d1c56034ffb2a81d109b00d4684130593f79cd8",
    "c5bd778824e8bf37b110157cea3ac2a25b274be05104149b7ab190f4c72186b293c1dab0b2e7c6bb739d4",
    "3de7687de186cd92403cebd0827e653fccfa92f3c27f5d1d3544def3ae387a869dac79f3ac9761d34d8a6",
    "4489f10b27b857c82809d203990e0e0e2d8eb63231b8074fb734bdcdb25e2ed550968cd17dc9c907d2aa4",
    "fefc05cc0cca885f47021485f26316243ffc5a7e657a839795040fd1477b4801a54f8e7082494b9e38b4a",
    "e252e5e7583b5b702eb37e8658e9eb22e476f9707ba6f4af3f83b5724ca486da18536316b3e39287fb613",
    # The Second VK Page Access Tokens
    "c6d874a5774001fb5029fe281d3bd52d1ba6a30d2ec8f5e8ac38bf07039bf7c77886aedac7547848531ff",
    "f9c3048bc3ea184420cfe4d543ed623c084b7bdc00031067cef7b7edf0f21e5440ad75affce9bfa1b4edf",
    "b02bb38695039681612c5d4373d68a446090ffcfe322a6081d999ff9b1c72c85e93d3d7d36bad0396999b",
    "b3e0c1548b4dc594140988233dd54169dff882a65b88db6cfb60f9e9b7864da2f32a155c930806b9dbd2f",
    "365d39a452f41ddb1f6343baf264d7f5698c76253ffaa53e6885c4269d373e7400026abe05c1fb2e70b20",
    "a59d7115c39ebb088ee518747d0f009ea5e4e696ebdd49d52f212cb410b12a2153025e0866293d8f75328",
    "60a4b05dad8b389ec4a4c1e886925ce1cd5e94054a329b144c715291d0d03edc94d1fe91f77f96a677980"
]

vkGroupsIDs = ["73247559", "97385648", "31038184", "20629724", "145800770", "113086748", "55072656", "74192244",
               "148211806", "137477261", "28905875", "79997904", "78333766", "55744096", "22884714",
               "80197218", "53921002", "29573241", "101209760"]

startMessage = \
    "Благодарю за возникший интерес ко мне! *Cоциальные сети* — _абсолютное зло_ из 2004 года, с тех пор они _не видоизменились_ и _не поменяли_ своей сути." \
    "\n\n"\
    "На моей памяти существует множество людей, которые _хотели отказаться_ от социальных сетей, но не могли из-за одной их возможности — _сообществ_. " \
    "В Telegram для их замены существуют _каналы_, но их мало, кто создает и ведет их. Мне в один момент это надоело, поэтому сейчас и существует этот Бот, " \
    "который в этом хорошем деле поможет[.](http://telegra.ph/Otkaz-ot-polzovaniya-socialnymi-setyami-06-05) " \
    "[Также подпишитесь на канал](http://t.me/paparazziBarbos), в нем публикуются предложенные Вами посты, мои мысли, " \
    "репосты из других источников, картинки и вообще все, что реально годно!" \
    "\n\n" \
    "Бот работает в данный момент только с сообществами ВКонтакте. *Ниже перечислены основные его возможности, которые помогут отказаться от социальных сетей:*" \
    "\n" \
    "   - Вы можете задать Боту сообщества, из которых хотите получать репосты новых публикаций." \
    "\n" \
    "   - _Два раза в день_ Вы получаете подборку самых лучших публикаций из сообществ, на которые подписаны." \
    "\n\n" \
    "Более подробная информация обо всем расположена в полной статье, которая находится [здесь](http://telegra.ph/Otkaz-ot-polzovaniya-socialnymi-setyami-06-05)."
